{"length":{"s":"The length property represents an unsigned, 32-bit integer that specifies the number of elements in an array.","y":"arr.length","p":null},"pop":{"s":"The pop() method removes the last element from an array and returns that element.","y":"arr.pop()","p":null},"push":{"s":"The push() method mutates an array by appending the given elements and returning the new length of the array.","y":"arr.push(element1, ..., elementN)","p":[{"t":"element1, ..., elementN","d":"The elements to add to the end of the array."}]},"reverse":{"s":"The reverse() method reverses an array in place. The first array element becomes the last and the last becomes the first.","y":"arr.reverse()","p":null},"shift":{"s":"The shift() method removes the first element from an array and returns that element. This method changes the length of the array.","y":"arr.shift()","p":null},"sort":{"s":"The sort() method sorts the elements of an array in place and returns the array. The sort is not necessarily stable. The default sort order is lexicographic (not numeric).","y":"arr.sort([compareFunction])","p":[{"t":"compareFunction","d":"Specifies a function that defines the sort order. If omitted, the array is sorted lexicographically (in dictionary order) according to the string conversion of each element."}]},"splice":{"s":"The splice() method changes the content of an array, adding new elements while removing old elements.","y":"array.splice(index , howMany[, element1[, ...[, elementN]]])\n\narray.splice(index) \/\/ SpiderMonkey\/Firefox extension","p":[{"t":"index","d":"Index at which to start changing the array. If greater than the length of the array, actual starting index will be set to the length of the array. If negative, will begin that many elements from the end."},{"t":"howMany","d":"An integer indicating the number of old array elements to remove. If howMany is 0, no elements are removed. In this case, you should specify at least one new element. If howMany is greater than the number of elements left in the array starting at index, then all of the elements through the end of the array will be deleted. If no howMany parameter is specified (second syntax above, which is a SpiderMonkey extension), all elements after index are removed."},{"t":"element1, ..., elementN","d":"The elements to add to the array. If you don't specify any elements, splice simply removes elements from the array."}]},"unshift":{"s":"The unshift() method adds one or more elements to the beginning of an array and returns the new length of the array.","y":"arr.unshift(element1, ..., elementN) ","p":[{"t":"element1, ..., elementN","d":"The elements to add to the front of the array."}]},"concat":{"s":"The concat() method returns a new array comprised of this array joined with other array(s) and\/or value(s).","y":"arr.concat(value1, value2, ..., valueN)","p":[{"t":"valueN","d":"Arrays and\/or values to concatenate to the resulting array."}]},"join":{"s":"The join() method joins all elements of an array into a string.","y":"str = arr.join(separator)","p":[{"t":"separator","d":"Specifies a string to separate each element of the array. The separator is converted to a string if necessary. If omitted, the array elements are separated with a comma."}]},"slice":{"s":"The slice() method returns a shallow copy of a portion of an array into a new array object.","y":"arr.slice(begin[, end])","p":null},"toSource":{"s":"The toSource() method returns a string representing the source code of the array.","y":"arr.toSource()","p":null},"toString":{"s":"The toString() method returns a string representing the specified array and its elements.","y":"arr.toString()","p":null},"toLocaleString":{"s":"The toLocaleString() method returns a string representing the elements of the array. The elements are converted to Strings using their toLocaleString methods and these Strings are separated by a locale-specific String (such as a comma \",\").","y":"arr.toLocaleString();","p":null},"indexOf":{"s":"The indexOf() method returns the first index at which a given element can be found in the array, or -1 if it is not present.","y":"arr.indexOf(searchElement[, fromIndex])","p":[{"t":"searchElement","d":"Element to locate in the array."},{"t":"fromIndex","d":"Default: 0 (Entire array is searched)\n  The index to start the search at. If the index is greater than or equal to the array's length, -1 is returned, which means the array will not be searched. If the provided index value is a negative number, it is taken as the offset from the end of the array. Note: if the provided index is negative, the array is still searched from front to back. If the calculated index is less than 0, then the whole array will be searched."}]},"lastIndexOf":{"s":"The lastIndexOf() method returns the last index at which a given element can be found in the array, or -1 if it is not present. The array is searched backwards, starting at fromIndex.","y":"array.lastIndexOf(searchElement[, fromIndex])","p":null},"forEach":{"s":"The forEach() method executes a provided function once per array element.","y":"arr.forEach(callback[, thisArg])","p":[{"t":"callback","d":"Function to execute for each element."},{"t":"thisArg","d":"Value to use as this when executing callback."}]},"entries":{"s":"The entries() method returns a new Array Iterator object that contains the key\/value pairs for each index in the array.","y":"arr.entries()","p":null},"every":{"s":"The every() method tests whether all elements in the array pass the test implemented by the provided function.","y":"arr.every(callback[, thisArg])","p":[{"t":"callback","d":"Function to test for each element."},{"t":"thisArg","d":"Value to use as this when executing callback."}]},"some":{"s":"The some() method tests whether some element in the array passes the test implemented by the provided function.","y":"arr.some(callback[, thisArg])","p":[{"t":"callback","d":"Function to test for each element."},{"t":"thisArg","d":"Value to use as this when executing callback."}]},"filter":{"s":"The filter() method creates a new array with all elements that pass the test implemented by the provided function.","y":"arr.filter(callback[, thisArg])","p":[{"t":"callback","d":"Function to test each element of the array."},{"t":"thisArg","d":"Value to use as this when executing callback."}]},"find":{"s":"The find() method returns a value in the array, if an element in the array satisfies the provided testing function. Otherwise undefined is returned.","y":"arr.find(callback[, thisArg])","p":[{"t":"callback","d":""},{"t":"element","d":"The current element being processed in the array."},{"t":"index","d":"The index of the current element being processed in the array."},{"t":"array","d":"The array find was called upon."},{"t":"thisArg","d":"Object to use as this when executing callback."}]},"findIndex":{"s":"The findIndex() method returns an index in the array, if an element in the array satisfies the provided testing function. Otherwise -1 is returned.","y":"arr.findIndex(callback[, thisArg])","p":[{"t":"callback","d":""},{"t":"element","d":"The current element being processed in the array."},{"t":"index","d":"The index of the current element being processed in the array."},{"t":"array","d":"The array findIndex was called upon."},{"t":"thisArg","d":"Object to use as this when executing callback."}]},"keys":{"s":"The keys() method returns a new Array Iterator that contains the keys for each index in the array.","y":"arr.keys()","p":null},"map":{"s":"The map() method creates a new array with the results of calling a provided function on every element in this array.","y":"arr.map(callback[, thisArg])","p":null},"reduce":{"s":"The reduce() method applies a function against an accumulator and each value of the array (from left-to-right) has to reduce it to a single value.","y":"arr.reduce(callback,[initialValue])","p":[{"t":"callback","d":""},{"t":"previousValue","d":"The value previously returned in the last invocation of the callback, or initialValue, if supplied. (See below.)"},{"t":"currentValue","d":"The current element being processed in the array."},{"t":"index","d":"The index of the current element being processed in the array."},{"t":"array","d":"The array reduce was called upon."},{"t":"initialValue","d":"Object to use as the first argument to the first call of the callback."}]},"reduceRight":{"s":"The reduceRight() method applies a function against an accumulator and each value of the array (from right-to-left) as to reduce it to a single value.","y":"arr.reduceRight(callback[, initialValue])","p":[{"t":"callback","d":""},{"t":"previousValue","d":"The value previously returned in the last invocation of the callback, or initialValue, if supplied. (See below.)"},{"t":"currentValue","d":"The current element being processed in the array."},{"t":"index","d":"The index of the current element being processed in the array."},{"t":"array","d":"The array reduce was called upon."},{"t":"initialValue","d":"Object to use as the first argument to the first call of the callback."}]}}