{"eval":{"s":"The eval() method evaluates JavaScript code represented as a string.","y":"eval(string)","p":[{"t":"string","d":"A string representing a JavaScript expression, statement, or sequence of statements. The expression can include variables and properties of existing objects."}]},"uneval":{"s":"The uneval() method creates an string representation of the source code of an Object.","y":"uneval(object)","p":[{"t":"object","d":"A JavaScript expression or statement."}]},"isFinite":{"s":"The global isFinite() function determines whether the passed value is a finite number. If needed, the parameter is first converted to a number.","y":"isFinite(testValue)","p":[{"t":"testValue","d":"The value to be tested for finiteness."}]},"isNaN":{"s":"The isNaN() function determines whether a value is NaN or not. Be careful, this function is broken. You may be interested in Number.isNaN() as defined in ECMAScript 6 or you can use typeof to determine if the value is Not-A-Number.","y":"isNaN(testValue)","p":[{"t":"testValue","d":"The value to be tested."}]},"parseFloat":{"s":"The parseFloat() function parses a string argument and returns a floating point number.","y":"parseFloat(string)","p":[{"t":"string","d":"A string that represents the value you want to parse."}]},"parseInt":{"s":"The parseInt() function parses a string argument and returns an integer of the specified radix or base.","y":"parseInt(string, radix);","p":[{"t":"string","d":"The value to parse. If string is not a string, then it is converted to one. Leading whitespace in the string is ignored."},{"t":"radix","d":"An integer that represents the radix of the above mentioned string. Always specify this parameter to eliminate reader confusion and to guarantee predictable behavior. Different implementations produce different results when a radix is not specified."}]},"decodeURI":{"s":"The decodeURI() function decodes a Uniform Resource Identifier (URI) previously created by encodeURI or by a similar routine.","y":"decodeURI(encodedURI)","p":[{"t":"encodedURI","d":"A complete, encoded Uniform Resource Identifier."}]},"decodeURIComponent":{"s":"The decodeURIComponent() method decodes a Uniform Resource Identifier (URI) component previously created by encodeURIComponent or by a similar routine.","y":"decodeURIComponent(encodedURI)","p":[{"t":"encodedURI","d":"An encoded component of a Uniform Resource Identifier."}]},"encodeURI":{"s":"The encodeURI() method encodes a Uniform Resource Identifier (URI) by replacing each instance of certain characters by one, two, three, or four escape sequences representing the UTF-8 encoding of the character (will only be four escape sequences for characters composed of two \"surrogate\" characters).","y":"encodeURI(URI)","p":[{"t":"URI","d":"A complete Uniform Resource Identifier."}]},"encodeURIComponent":{"s":"The encodeURIComponent() method encodes a Uniform Resource Identifier (URI) component by replacing each instance of certain characters by one, two, three, or four escape sequences representing the UTF-8 encoding of the character (will only be four escape sequences for characters composed of two \"surrogate\" characters).","y":"encodeURIComponent(str);","p":[{"t":"str","d":"String. A component of a URI."}]},"escape":{"s":"The deprecated escape() method computes a new string in which certain characters have been replaced by a hexadecimal escape sequence. Use encodeURI or encodeURIComponent instead.","y":"escape(str)","p":[{"t":"str","d":"A string to be encoded."}]},"unescape":{"s":"The deprecated unescape() method computes a new string in which hexadecimal escape sequences are replaced with the character that it represents. The escape sequences might be introduced by a function like escape. Because unescape is deprecated, use decodeURI or decodeURIComponent instead.","y":"unescape(str)","p":[{"t":"str","d":"A string to be decoded."}]}}